app/controllers/admin/records_controller.rb

  def index
    @q = Form::Record.includes(:tune).search
    @jpops = Form::Record.where(genre: "Japanese Rock / Pops / Indies").limit(4).order(:stock)
    @pops = Form::Record.where(genre: "Rock / Pops / Indies").limit(4).order(:stock)
    @edms = Form::Record.where(genre: "Electric Dance Music").limit(4).order(:stock)
    @ors = Form::Record.where(genre: "Old Rock").limit(4).order(:stock)
    @hrs = Form::Record.where(genre: "Hard Rock / Heavy Metal").limit(4).order(:stock)
    @punks = Form::Record.where(genre: "PUNK").limit(4).order(:stock)
    @jazzs = Form::Record.where(genre: "JAZZ").limit(4).order(:stock)
    @classics = Form::Record.where(genre: "CLASSIC").limit(4).order(:stock)
    @sts = Form::Record.where(genre: "Sound Track").limit(4).order(:stock)
    @sks = Form::Record.where(genre: "昭和歌謡曲 / 演歌").limit(4).order(:stock)
    @idles = Form::Record.where(genre: "アイドル").limit(4).order(:stock)
    @kpops = Form::Record.where(genre: "K-POP").limit(4).order(:stock)
    @setting = Setting.find(1)
---
SELECT "records".* FROM "records" WHERE "records"."deleted_at" IS NULL
SELECT  "records".* FROM "records" WHERE "records"."deleted_at" IS NULL AND "records"."genre" = ? ORDER BY "records"."stock" ASC LIMIT ?  [["genre", "Japanese Rock / Pops / Indies"], ["LIMIT", 4]]
SELECT  "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def search
    # @q = Form::Record.search(search_params)
    # @records = @q
    #   .result(distinct: true)
    #   .order(:artist_name, created_at: :desc)
    @q = Form::Record.search(params[:q])
    @records = @q.result(distinct: true).order(:stock)
---
SELECT DISTINCT "records".* FROM "records" WHERE "records"."deleted_at" IS NULL ORDER BY "records"."stock" DESC, "records"."stock" ASC

  def create
    @record = Form::Record.new(record_params)
    if @record.save
---
INSERT INTO "records" ("name", "image_id", "price", "label", "genre", "stock", "created_at", "updated_at", "body", "artist_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @record.update_attributes(record_params)
---
UPDATE "records" SET "stock" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["stock", 0], ["updated_at", "2019-08-16 12:02:03.592742"], ["id", 4]]

  def set_record
    @record = Form::Record.find(params[:id])
---
SELECT  "records".* FROM "records" WHERE "records"."deleted_at" IS NULL AND "records"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]