app/views/records/show.html.erb

SELECT "tunes".* FROM "tunes" WHERE "tunes"."record_id" = ?  [["record_id", 1]]
---
            <!-- もし、recordの曲が最後、または、曲のディスクナンバーと次の曲のディスクナンバーが一致しなかったとき -->
        <% if (i == @record.tunes.size - 1) || (tune.disc_no != @record.tunes[i+1].disc_no) %>