app/views/cart_items/index.html.erb

  	  <td>
        <% record_img = RecordImg.find_by(record_id: cart.record.id, order: 1) %>
---
SELECT "records".* FROM "records" INNER JOIN "artists" ON "artists"."id" = "records"."artist_id" AND "artists"."deleted_at" IS NULL INNER JOIN "cart_items" ON "cart_items"."record_id" = "records"."id" WHERE "records"."deleted_at" IS NULL