app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists" WHERE "artists"."deleted_at" IS NULL
---
    def index
        @artists = Artist.all

INSERT INTO "artists" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "いきものがかり"], ["description", "テキストテキストテキストテキストテキストテキストテキストテキスト"], ["created_at", "2019-08-16 03:42:30.076907"], ["updated_at", "2019-08-16 03:42:30.076907"]]
---
    def create
        @artist = Artist.new(artist_params)
        if @artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."deleted_at" IS NULL AND "artists"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def edit
        @artist = Artist.find(params[:id])