app/controllers/cart_items_controller.rb

  def index
    @cart_item = CartItem.where(user_id: current_user.id )
    @setting = Setting.find(1)
    @sum = 0

    @stock_array = []
      @cart_item.each do |cart|
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def destroy
    @cart_item = CartItem.find(params[:id])
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]