app/views/admin/records/_form.html.erb

SELECT "artists".* FROM "artists" WHERE "artists"."deleted_at" IS NULL ORDER BY name
---
            </div>
            <%= f.collection_select :artist_id, f.object.selectable_artists, :id, :name, {}, placeholder: "アーティストを選択してください", class: 'col-xs-10 col-xs-offset-1 form-control h4' %>